[Run]
Gamepath=D:\Documents\JL\
; 0简体1繁体
language=0
; 游戏数据语言编码0为GB，1为big5
datacode=0
checkupdate=0
IniVersion=1052
firstrun=0
leftcolumn=0
topcolumn=0
talkcode=0
talkinvert=0
; talkcode=1
; talkinvert=0


[File]
; 256调色板
Palette=data\mmap.col

; 可以查看的主要贴图文件
FileNumber=6
File0=data\hdgrp.idx,data\hdgrp.grp,头像贴图
Section0=
File1=data\mmap.idx,data\mmap.grp,主地图贴图
Section1=地面,0,701,表面,701,1001,建筑,1001,1501,人物,2501,2553,物品,3501,3701
File2=data\SMAP.IDX,data\SMAP.GRP,场景贴图
Section2= 
File3=data\WMAP.IDX,data\WMAP.GRP,战场贴图
Section3=
File4=data\THING.IDX,data\THING.GRP,物品贴图
Section4=
File5=data\Eft.IDX,data\Eft.GRP,特效贴图
Section5=

FightNum=999
; 战斗贴图 
FightName=data\fight\Fight***.idx,data\fight\Fight***.grp,战斗贴图
  
; 进度文件(对话事件战斗等编辑器缺省读取的进度文件)
RIDX=data\ranger.idx,data\ranger.idx,ranger.idx,ranger.idx,ranger.idx,ranger.idx,Ranger.idx
RGRP=data\Ranger.grp,data\save\R.grp,data\save\R.grp,R.grp,R.grp,R.grp,R.grp
SIDX=data\allsin.idx,data\allsin.idx,allsin.idx,allsin.idx,allsin.idx,allsin.idx
SGRP=data\allsin.grp,data\save\S.grp,data\save\S.grp,S.grp,S.grp,S.grp,S.grp
DIDX=data\alldef.idx,data\alldef.idx,alldef.idx,alldef.idx,alldef.idx,alldef.idx
DGRP=data\alldef.grp,data\save\D.grp,data\save\D.grp,D.grp,D.grp,D.grp,D.grp  
RecordNote=新游戏进度,进度一,进度二,进度三,进度四,进度五,自动挡

; 对话文件
TalkIDX=data\talk.idx
TalkGRP=data\talk.grp
; 战斗定义文件
WarDefine =data\War.sta

; 战斗地图结构文件
WarMAPDefIDX=data\Allsin.idx
WarMAPDefGRP=data\Allsin.grp
 
; 应写上合并后的文件名，如wdx/wmp。
WarMapIDX=data\WMAP.IDX
WarMapGRP=data\WMAP.GRP 

; 场景地图合并后的文件名，如sdx/smp。
SMAPIDX=data\SMAP.IDX
SMAPGRP=data\SMAP.GRP 

; 事件文件
KdefIDx=data\Kdef.idx
KdefGRP=data\Kdef.grp

; 主地图
MMAPIDX =data\mmap.idx
MMAPGRP =data\mmap.grp

; 主地图结构    
MMAPStruct =data\earth.002,data\Surface.002,data\Building.002,data\Buildx.002,data\Buildy.002

; 复刻专有文件
Leave=list\leave.bin
Effect=list\effect.bin
Match=list\Match.bin 
Exp=list\levelup.bin
warsmallmapsize=10
GRPselect=0
SceneMode=0
MMapMode=0
GRPListBackGround=12632256
WarMode=0


; 修改R*数据
[R_Modify]
; 6种数据
TypeNumber=6 
    
TypeName0=基本数据
TypeDataItem0=29
; 数组个数，数组结构成员个数，字节数，是否字串，是否名称，引用数据类型，名字，说明
; 间隔使用空格，一定要注意字符串中间不能有空格，而且空格只能有一个，等号后面不能有空格
Data(0,0) =1 1 2 0 0 -1 乘船 0主角不乘船/1主角乘船 
data(0,1) =1 1 2 0 0 -1 无用 无用 
data(0,2) =1 1 2 0 0 -1 人X 大地图人横坐标X(0-479) 
data(0,3) =1 1 2 0 0 -1 人Y 大地图人纵坐标X(0-479) 
data(0,4) =1 1 2 0 0 -1 人X1坐标 进入场景的横坐标X(0-63)，不用修改，进入场景自动变化 
data(0,5) =1 1 2 0 0 -1 人Y1坐标 进入场景的纵坐标X(0-63)，不用修改，进入场景自动变化 
data(0,6) =1 1 2 0 0 -1 人面对方向 0上1右2左3下,0
data(0,7) =1 1 2 0 0 -1 船X 船X 
data(0,8) =1 1 2 0 0 -1 船Y 船Y
data(0,9) =1 1 2 0 0 -1 船X1 船X1
data(0,10) =1 1 2 0 0 -1 船Y1 船Y1
data(0,11) =1 1 2 0 0 -1 船面对方向 0上1右2左3下
data(0,12) =1 1 2 0 0 -1 难度 游戏难度
data(0,13) =1 1 2 0 0 -1 标准 标准主角编号
data(0,14) =1 1 2 0 0 -1 畅想 畅想主角编号
data(0,15) =1 1 2 0 0 -1 特殊 特殊主角编号
data(0,16) =1 1 2 0 0 -1 单通 是否为单通模式
data(0,17) =1 1 2 0 0 -1 周目 本次游戏周目
data(0,18) =1 1 2 0 0 -1 天书数量 所持天书数量
data(0,19) =1 1 2 0 0 -1 武功数量 备用
data(0,20) =1 1 2 0 0 -1 碎片 备用
data(0,21) =1 1 2 0 0 -1 游戏模式 游戏模式
data(0,22) =1 1 2 0 0 -1 天关 天关
data(0,23) =1 1 2 0 0 -1 开局 开局
data(0,24) =1 1 2 0 0 -1 备用2 备用
data(0,25) =1 1 2 0 0 -1 备用1 备用
data(0,26) =15 1 2 0 0 1 队友 队友(-1表示为空)，第一个必须是主角，不能修改
data(0,27) =1000 2 2 0 0 2 物品 物品(-1表示为空)
data(0,28) =0 1 2 0 0 -1 物品个数 物品个数
    
TypeName1=人物
TypeDataItem1=436
	
data(1,0) =1 1 2 0 0 -1 代号 人物代号，仅作为标志，游戏不使用，偏移0
data(1,1) =1 1 2 0 0 -1 头像/战斗代号 人物头像代号(hdgrp)和战斗动作编号Fight***，偏移2
data(1,2) =1 1 2 0 0 -1 生命增长 升级时生命增长幅度，每升一级生命最大值增长：3*生命增长+(0-6)随机，偏移4
data(1,3) =1 1 2 0 0 -1 无用 无用，偏移6
data(1,4) =1 1 10 1 1 -1 姓名 姓名，最多4个汉字，偏移8
data(1,5) =1 1 10 1 0 -1 外号 外号，最多5个汉字，程序中似乎不用，偏移18
data(1,6) =1 1 2 0 0 -1 性别 性别，0男1女2太监，偏移28
data(1,7) =1 1 2 0 0 -1 等级 等级，最多30级，偏移30
data(1,8) =1 1 2 0 0 -1 经验值 经验值，最高60000，偏移32
data(1,9) =1 1 2 0 0 -1 生命 生命值，最高999，偏移34
data(1,10) =1 1 2 0 0 -1 生命最大值 生命最大值，最高999，偏移36
data(1,11) =1 1 2 0 0 -1 受伤程度 受伤程度，最高100。过重影响医疗，不能住宿恢复生命等。医疗/吃药可减少，偏移38
data(1,12) =1 1 2 0 0 -1 中毒程度 中毒程度，中毒后战斗每回合减少生命，中毒越深减少越多。，偏移40
data(1,13) =1 1 2 0 0 -1 体力 体力，最大100，偏移42
data(1,14) =1 1 2 0 0 -1 物品修炼点数 物品修炼点数，修炼能练出物品的秘笈时使用，偏移44
data(1,15) =1 1 2 0 0 2 武器 武器物品代号，偏移46
data(1,16) =1 1 2 0 0 2 防具 防具物品代号，偏移48
data(1,17) =1 1 2 0 0 -1 出招动画帧数 fight***中每方向动画帧数，1医疗/用毒/解毒，起始偏移50
data(1,18) =1 1 2 0 0 -1 出招动画帧数 fight***中每方向动画帧数，2拳，起始偏移52
data(1,19) =1 1 2 0 0 -1 出招动画帧数 fight***中每方向动画帧数，3剑，起始偏移54
data(1,20) =1 1 2 0 0 -1 出招动画帧数 fight***中每方向动画帧数，4刀，起始偏移56
data(1,21) =1 1 2 0 0 -1 出招动画帧数 fight***中每方向动画帧数，5特殊，起始偏移58
data(1,22) =1 1 2 0 0 -1 出招动画延迟 1医疗/用毒/解毒出招动画延迟帧数，出招动画开始到此延迟帧数后才显示武功效果，起始偏移60
data(1,23) =1 1 2 0 0 -1 出招动画延迟 2拳出招动画延迟帧数，出招动画开始到此延迟帧数后才显示武功效果，起始偏移62
data(1,24) =1 1 2 0 0 -1 出招动画延迟 3剑出招动画延迟帧数，出招动画开始到此延迟帧数后才显示武功效果，起始偏移64
data(1,25) =1 1 2 0 0 -1 出招动画延迟 4刀出招动画延迟帧数，出招动画开始到此延迟帧数后才显示武功效果，起始偏移66
data(1,26) =1 1 2 0 0 -1 出招动画延迟 5特殊出招动画延迟帧数，出招动画开始到此延迟帧数后才显示武功效果，起始偏移68
data(1,27) =1 1 2 0 0 -1 武功音效延迟 相应的武功音效延迟帧数，出招动画开始到此延迟帧数后才播放武功音效，起始偏移70
data(1,28) =1 1 2 0 0 -1 武功音效延迟 相应的武功音效延迟帧数，出招动画开始到此延迟帧数后才播放武功音效，起始偏移72
data(1,29) =1 1 2 0 0 -1 武功音效延迟 相应的武功音效延迟帧数，出招动画开始到此延迟帧数后才播放武功音效，起始偏移74
data(1,30) =1 1 2 0 0 -1 武功音效延迟 相应的武功音效延迟帧数，出招动画开始到此延迟帧数后才播放武功音效，起始偏移76
data(1,31) =1 1 2 0 0 -1 武功音效延迟 相应的武功音效延迟帧数，出招动画开始到此延迟帧数后才播放武功音效，起始偏移78
data(1,32) =1 1 2 0 0 -1 内力性质 内力性质，0阴性、1阳性、2阴阳调和，偏移80
data(1,33) =1 1 2 0 0 -1 内力 内力，最大999，偏移82
data(1,34) =1 1 2 0 0 -1 内力最大值 内力最大值，最大999，偏移84
data(1,35) =1 1 2 0 0 -1 攻击力 攻击力，最大100，偏移86
data(1,36) =1 1 2 0 0 -1 轻功 轻功，最大100，偏移88
data(1,37) =1 1 2 0 0 -1 防御力 防御力，最大100，偏移90
data(1,38) =1 1 2 0 0 -1 医疗 医疗，最大100，偏移92
data(1,39) =1 1 2 0 0 -1 用毒 用毒，最大100，偏移94
data(1,40) =1 1 2 0 0 -1 解毒 解毒，最大100，偏移96
data(1,41) =1 1 2 0 0 -1 抗毒 抗毒，最大100，偏移98
data(1,42) =1 1 2 0 0 -1 拳掌 拳掌，最大100，偏移100
data(1,43) =1 1 2 0 0 -1 指法 指法，最大100，偏移102
data(1,44) =1 1 2 0 0 -1 御剑 御剑，最大100，偏移104
data(1,45) =1 1 2 0 0 -1 耍刀 耍刀，最大100，偏移106
data(1,46) =1 1 2 0 0 -1 奇门 奇门，最大100，偏移108
data(1,47) =1 1 2 0 0 -1 暗器技巧 暗器技巧，最大100，偏移110
data(1,48) =1 1 2 0 0 -1 武学常识 武学常识，最大100，偏移112
data(1,49) =1 1 2 0 0 -1 品德 品德，最大100，偏移114
data(1,50) =1 1 2 0 0 -1 攻击带毒 攻击带毒，最大100，偏移116
data(1,51) =1 1 2 0 0 -1 左右互搏 左右互搏，0战斗攻击一次，1战斗攻击两次，偏移118
data(1,52) =1 1 2 0 0 -1 声望 个人声望，偏移120
data(1,53) =1 1 2 0 0 -1 资质 资质，资质越高修炼所需经验越少，偏移122
data(1,54) =1 1 2 0 0 2 修练物品 当前修练物品代号，偏移124
data(1,55) =1 1 2 0 0 -1 修炼点数 修炼点数，当前修炼点数，偏移126
data(1,56) =1 1 2 0 0 4 所会武功1 所会武功1代号，0表示没有武功，起始偏移128
data(1,57) =1 1 2 0 0 4 所会武功2 所会武功2代号，0表示没有武功，起始偏移130
data(1,58) =1 1 2 0 0 4 所会武功3 所会武功3代号，0表示没有武功，起始偏移132
data(1,59) =1 1 2 0 0 4 所会武功4 所会武功4代号，0表示没有武功，起始偏移134
data(1,60) =1 1 2 0 0 4 所会武功5 所会武功5代号，0表示没有武功，起始偏移136
data(1,61) =1 1 2 0 0 4 所会武功6 所会武功6代号，0表示没有武功，起始偏移138
data(1,62) =1 1 2 0 0 4 所会武功7 所会武功7代号，0表示没有武功，起始偏移140
data(1,63) =1 1 2 0 0 4 所会武功8 所会武功8代号，0表示没有武功，起始偏移142
data(1,64) =1 1 2 0 0 4 所会武功9 所会武功9代号，0表示没有武功，起始偏移144
data(1,65) =1 1 2 0 0 4 所会武功10 所会武10功代号，0表示没有武功，起始偏移146
data(1,66) =1 1 2 0 0 4 所会武功11 所会武11功代号，0表示没有武功，起始偏移148
data(1,67) =1 1 2 0 0 4 所会武功12 所会武12功代号，0表示没有武功，起始偏移150
data(1,68) =1 1 2 0 0 4 所会武功13 所会武13功代号，0表示没有武功，起始偏移152
data(1,69) =1 1 2 0 0 4 所会武功14 所会武14功代号，0表示没有武功，起始偏移154
data(1,70) =1 1 2 0 0 4 所会武功15 所会武15功代号，0表示没有武功，起始偏移156
data(1,71) =1 1 2 0 0 -1 所会武功1等级 所会武功1等级，100分一级，900点十级，起始偏移158
data(1,72) =1 1 2 0 0 -1 所会武功2等级 所会武功2等级，100分一级，900点十级，起始偏移160
data(1,73) =1 1 2 0 0 -1 所会武功3等级 所会武功3等级，100分一级，900点十级，起始偏移162
data(1,74) =1 1 2 0 0 -1 所会武功4等级 所会武功4等级，100分一级，900点十级，起始偏移164
data(1,75) =1 1 2 0 0 -1 所会武功5等级 所会武功5等级，100分一级，900点十级，起始偏移166
data(1,76) =1 1 2 0 0 -1 所会武功6等级 所会武功6等级，100分一级，900点十级，起始偏移168
data(1,77) =1 1 2 0 0 -1 所会武功7等级 所会武功7等级，100分一级，900点十级，起始偏移170
data(1,78) =1 1 2 0 0 -1 所会武功8等级 所会武功8等级，100分一级，900点十级，起始偏移172
data(1,79) =1 1 2 0 0 -1 所会武功9等级 所会武功9等级，100分一级，900点十级，起始偏移174
data(1,80) =1 1 2 0 0 -1 所会武功10等级 所会武功10等级，100分一级，900点十级，起始偏移176
data(1,81) =1 1 2 0 0 -1 所会武功11等级 所会武功11等级，100分一级，900点十级，起始偏移178
data(1,82) =1 1 2 0 0 -1 所会武功12等级 所会武功12等级，100分一级，900点十级，起始偏移180
data(1,83) =1 1 2 0 0 -1 所会武功13等级 所会武功13等级，100分一级，900点十级，起始偏移182
data(1,84) =1 1 2 0 0 -1 所会武功14等级 所会武功14等级，100分一级，900点十级，起始偏移184
data(1,85) =1 1 2 0 0 -1 所会武功15等级 所会武功15等级，100分一级，900点十级，起始偏移186
data(1,86) =1 1 2 0 0 2 携带物品1 携带物品1代号，起始偏移188
data(1,87) =1 1 2 0 0 2 携带物品2 携带物品2代号，起始偏移190
data(1,88) =1 1 2 0 0 2 携带物品3 携带物品3代号，起始偏移192
data(1,89) =1 1 2 0 0 2 携带物品4 携带物品4代号，起始偏移194
data(1,90) =1 1 2 0 0 -1 携带物品1数量 携带物品1数量，起始偏移196
data(1,91) =1 1 2 0 0 -1 携带物品2数量 携带物品2数量，起始偏移198
data(1,92) =1 1 2 0 0 -1 携带物品3数量 携带物品3数量，起始偏移200
data(1,93) =1 1 2 0 0 -1 携带物品4数量 携带物品4数量，起始偏移202
data(1,94) =1 1 2 0 0 4 天赋外功1 天赋外功1代号，0表示没有武功，起始偏移204
data(1,95) =1 1 2 0 0 4 天赋外功2 天赋外功2代号，0表示没有武功，起始偏移206
data(1,96) =1 1 2 0 0 4 属性点数 点数，起始偏移208
data(1,97) =1 1 2 0 0 4 武学点数 武学点数，起始偏移210
data(1,98) =1 1 2 0 0 4 天赋内功 天赋内功代号，0表示没有武功，起始偏移212
data(1,99) =1 1 2 0 0 4 天赋轻功 天赋轻功代号，0表示没有武功，起始偏移214
data(1,100) =1 1 2 0 0 -1 实战 人物实战值，起始偏移216
data(1,101) =1 1 2 0 0 -1 出战 出战场数，起始偏移218
data(1,102) =1 1 2 0 0 -1 命中 命中，0表示没反击，起始偏移220
data(1,103) =1 1 2 0 0 4 主运内功 当前主运内功，0表示没有武功，起始偏移222
data(1,104) =1 1 2 0 0 4 主运轻功 当前主运轻功，0表示没有武功，起始偏移224
data(1,105) =1 1 2 0 0 -1 六如觉醒 六如觉醒次数，起始偏移226
data(1,106) =1 1 2 0 0 -1 个人觉醒 个人觉醒次数，起始偏移228
data(1,107) =1 1 2 0 0 -1 畅想分阶 人物的畅想分阶，起始偏移230
data(1,108) =1 1 10 1 0 -1 外号2 外号2，最多5个汉字，程序中似乎不用，偏移232
data(1,109) =1 1 2 0 0 -1 灼烧程度 灼烧程度，灼烧后被攻击时追加真实伤害，偏移242
data(1,110) =1 1 2 0 0 -1 冰封程度 冰封程度，冰封后战斗每回合减少内力，且集气下降，偏移244
data(1,111) =1 1 2 0 0 -1 论剑奖励 论剑奖励，偏移246
data(1,112) =1 1 2 0 0 -1 血量翻倍 血量翻倍倍数，偏移248
data(1,113) =1 1 2 0 0 -1 行为模式 1自动攻击2自动防御3原地休息4逃离休息，偏移250
data(1,114) =1 1 2 0 0 4 优先使用 战斗中优先使用的外功，偏移252
data(1,115) =1 1 2 0 0 -1 是否吃药 是否自动吃药，偏移254
data(1,116) =1 1 2 0 0 -1 能量 能量，偏移256
data(1,117) =1 1 2 0 0 -1 格档 格档，偏移258
data(1,118) =1 1 2 0 0 -1 特色指令 0没有1有，偏移260
data(1,119) =1 1 2 0 0 2 坐骑 0没有1有，偏移262
data(1,120) =1 1 2 0 0 -1 中庸 中庸，偏移264
data(1,121) =1 1 2 0 0 -1 半身像 半身像，偏移266
data(1,122) =1 1 2 0 0 -1 迷踪步 迷踪步，偏移268
data(1,123) =1 1 2 0 0 -1 门派 门派，偏移270
data(1,124) =1 1 2 0 0 -1 心魔 心魔，偏移272
data(1,125) =1 1 2 0 0 -1 拳掌奇穴等级1 拳掌奇穴等级1，偏移274
data(1,126) =1 1 2 0 0 -1 拳掌奇穴等级2 拳掌奇穴等级2，偏移276
data(1,127) =1 1 2 0 0 -1 拳掌奇穴等级3 拳掌奇穴等级3，偏移278
data(1,128) =1 1 2 0 0 -1 拳掌奇穴等级4 拳掌奇穴等级4，偏移280
data(1,129) =1 1 2 0 0 -1 拳掌奇穴等级5 拳掌奇穴等级5，偏移282
data(1,130) =1 1 2 0 0 -1 拳掌奇穴等级6 拳掌奇穴等级6，偏移284
data(1,131) =1 1 2 0 0 -1 拳掌奇穴等级7 拳掌奇穴等级7，偏移286
data(1,132) =1 1 2 0 0 -1 拳掌奇穴等级8 拳掌奇穴等级8，偏移288
data(1,133) =1 1 2 0 0 -1 拳掌奇穴等级9 拳掌奇穴等级9，偏移290
data(1,134) =1 1 2 0 0 -1 拳掌奇穴等级10 拳掌奇穴等级10，偏移292
data(1,135) =1 1 2 0 0 -1 拳掌奇穴等级11 拳掌奇穴等级11，偏移294
data(1,136) =1 1 2 0 0 -1 拳掌奇穴等级12 拳掌奇穴等级12，偏移296
data(1,137) =1 1 2 0 0 -1 拳掌奇穴等级13 拳掌奇穴等级13，偏移298
data(1,138) =1 1 2 0 0 -1 拳掌奇穴等级14 拳掌奇穴等级14，偏移300
data(1,139) =1 1 2 0 0 -1 拳掌奇穴等级15 拳掌奇穴等级15，偏移302
data(1,140) =1 1 2 0 0 -1 拳掌奇穴等级16 拳掌奇穴等级16，偏移304
data(1,141) =1 1 2 0 0 -1 拳掌奇穴等级17 拳掌奇穴等级17，偏移306
data(1,142) =1 1 2 0 0 -1 拳掌奇穴等级18 拳掌奇穴等级18，偏移308
data(1,143) =1 1 2 0 0 -1 拳掌奇穴等级19 拳掌奇穴等级19，偏移310
data(1,144) =1 1 2 0 0 -1 拳掌奇穴等级20 拳掌奇穴等级20，偏移312
data(1,145) =1 1 2 0 0 -1 拳掌奇穴等级21 拳掌奇穴等级21，偏移314
data(1,146) =1 1 2 0 0 -1 拳掌奇穴等级22 拳掌奇穴等级22，偏移316
data(1,147) =1 1 2 0 0 -1 拳掌奇穴等级23 拳掌奇穴等级23，偏移318
data(1,148) =1 1 2 0 0 -1 拳掌奇穴等级24 拳掌奇穴等级24，偏移320
data(1,149) =1 1 2 0 0 -1 拳掌奇穴等级25 拳掌奇穴等级25，偏移322
data(1,150) =1 1 2 0 0 -1 指法奇穴等级1 指法奇穴等级1，偏移324
data(1,151) =1 1 2 0 0 -1 指法奇穴等级2 指法奇穴等级2，偏移326
data(1,152) =1 1 2 0 0 -1 指法奇穴等级3 指法奇穴等级3，偏移328
data(1,153) =1 1 2 0 0 -1 指法奇穴等级4 指法奇穴等级4，偏移330
data(1,154) =1 1 2 0 0 -1 指法奇穴等级5 指法奇穴等级5，偏移332
data(1,155) =1 1 2 0 0 -1 指法奇穴等级6 指法奇穴等级6，偏移334
data(1,156) =1 1 2 0 0 -1 指法奇穴等级7 指法奇穴等级7，偏移336
data(1,157) =1 1 2 0 0 -1 指法奇穴等级8 指法奇穴等级8，偏移338
data(1,158) =1 1 2 0 0 -1 指法奇穴等级9 指法奇穴等级9，偏移340
data(1,159) =1 1 2 0 0 -1 指法奇穴等级10 指法奇穴等级10，偏移342
data(1,160) =1 1 2 0 0 -1 指法奇穴等级11 指法奇穴等级11，偏移344
data(1,161) =1 1 2 0 0 -1 指法奇穴等级12 指法奇穴等级12，偏移346
data(1,162) =1 1 2 0 0 -1 指法奇穴等级13 指法奇穴等级13，偏移348
data(1,163) =1 1 2 0 0 -1 指法奇穴等级14 指法奇穴等级14，偏移350
data(1,164) =1 1 2 0 0 -1 指法奇穴等级15 指法奇穴等级15，偏移352
data(1,165) =1 1 2 0 0 -1 指法奇穴等级16 指法奇穴等级16，偏移354
data(1,166) =1 1 2 0 0 -1 指法奇穴等级17 指法奇穴等级17，偏移356
data(1,167) =1 1 2 0 0 -1 指法奇穴等级18 指法奇穴等级18，偏移358
data(1,168) =1 1 2 0 0 -1 指法奇穴等级19 指法奇穴等级19，偏移360
data(1,169) =1 1 2 0 0 -1 指法奇穴等级20 指法奇穴等级20，偏移362
data(1,170) =1 1 2 0 0 -1 指法奇穴等级21 指法奇穴等级21，偏移364
data(1,171) =1 1 2 0 0 -1 指法奇穴等级22 指法奇穴等级22，偏移366
data(1,172) =1 1 2 0 0 -1 指法奇穴等级23 指法奇穴等级23，偏移368
data(1,173) =1 1 2 0 0 -1 指法奇穴等级24 指法奇穴等级24，偏移370
data(1,174) =1 1 2 0 0 -1 指法奇穴等级25 指法奇穴等级25，偏移372
data(1,175) =1 1 2 0 0 -1 御剑奇穴等级1 御剑奇穴等级1，偏移374
data(1,176) =1 1 2 0 0 -1 御剑奇穴等级2 御剑奇穴等级2，偏移376
data(1,177) =1 1 2 0 0 -1 御剑奇穴等级3 御剑奇穴等级3，偏移378
data(1,178) =1 1 2 0 0 -1 御剑奇穴等级4 御剑奇穴等级4，偏移380
data(1,179) =1 1 2 0 0 -1 御剑奇穴等级5 御剑奇穴等级5，偏移382
data(1,180) =1 1 2 0 0 -1 御剑奇穴等级6 御剑奇穴等级6，偏移384
data(1,181) =1 1 2 0 0 -1 御剑奇穴等级7 御剑奇穴等级7，偏移386
data(1,182) =1 1 2 0 0 -1 御剑奇穴等级8 御剑奇穴等级8，偏移388
data(1,183) =1 1 2 0 0 -1 御剑奇穴等级9 御剑奇穴等级9，偏移390
data(1,184) =1 1 2 0 0 -1 御剑奇穴等级10 御剑奇穴等级10，偏移392
data(1,185) =1 1 2 0 0 -1 御剑奇穴等级11 御剑奇穴等级11，偏移394
data(1,186) =1 1 2 0 0 -1 御剑奇穴等级12 御剑奇穴等级12，偏移396
data(1,187) =1 1 2 0 0 -1 御剑奇穴等级13 御剑奇穴等级13，偏移398
data(1,188) =1 1 2 0 0 -1 御剑奇穴等级14 御剑奇穴等级14，偏移400
data(1,189) =1 1 2 0 0 -1 御剑奇穴等级15 御剑奇穴等级15，偏移402
data(1,190) =1 1 2 0 0 -1 御剑奇穴等级16 御剑奇穴等级16，偏移404
data(1,191) =1 1 2 0 0 -1 御剑奇穴等级17 御剑奇穴等级17，偏移406
data(1,192) =1 1 2 0 0 -1 御剑奇穴等级18 御剑奇穴等级18，偏移408
data(1,193) =1 1 2 0 0 -1 御剑奇穴等级19 御剑奇穴等级19，偏移410
data(1,194) =1 1 2 0 0 -1 御剑奇穴等级20 御剑奇穴等级20，偏移412
data(1,195) =1 1 2 0 0 -1 御剑奇穴等级21 御剑奇穴等级21，偏移414
data(1,196) =1 1 2 0 0 -1 御剑奇穴等级22 御剑奇穴等级22，偏移416
data(1,197) =1 1 2 0 0 -1 御剑奇穴等级23 御剑奇穴等级23，偏移418
data(1,198) =1 1 2 0 0 -1 御剑奇穴等级24 御剑奇穴等级24，偏移420
data(1,199) =1 1 2 0 0 -1 御剑奇穴等级25 御剑奇穴等级25，偏移422
data(1,200) =1 1 2 0 0 -1 耍刀奇穴等级1 耍刀奇穴等级1，偏移424
data(1,201) =1 1 2 0 0 -1 耍刀奇穴等级2 耍刀奇穴等级2，偏移426
data(1,202) =1 1 2 0 0 -1 耍刀奇穴等级3 耍刀奇穴等级3，偏移428
data(1,203) =1 1 2 0 0 -1 耍刀奇穴等级4 耍刀奇穴等级4，偏移430
data(1,204) =1 1 2 0 0 -1 耍刀奇穴等级5 耍刀奇穴等级5，偏移432
data(1,205) =1 1 2 0 0 -1 耍刀奇穴等级6 耍刀奇穴等级6，偏移434
data(1,206) =1 1 2 0 0 -1 耍刀奇穴等级7 耍刀奇穴等级7，偏移436
data(1,207) =1 1 2 0 0 -1 耍刀奇穴等级8 耍刀奇穴等级8，偏移438
data(1,208) =1 1 2 0 0 -1 耍刀奇穴等级9 耍刀奇穴等级9，偏移440
data(1,209) =1 1 2 0 0 -1 耍刀奇穴等级10 耍刀奇穴等级10，偏移442
data(1,210) =1 1 2 0 0 -1 耍刀奇穴等级11 耍刀奇穴等级11，偏移444
data(1,211) =1 1 2 0 0 -1 耍刀奇穴等级12 耍刀奇穴等级12，偏移446
data(1,212) =1 1 2 0 0 -1 耍刀奇穴等级13 耍刀奇穴等级13，偏移448
data(1,213) =1 1 2 0 0 -1 耍刀奇穴等级14 耍刀奇穴等级14，偏移450
data(1,214) =1 1 2 0 0 -1 耍刀奇穴等级15 耍刀奇穴等级15，偏移452
data(1,215) =1 1 2 0 0 -1 耍刀奇穴等级16 耍刀奇穴等级16，偏移454
data(1,216) =1 1 2 0 0 -1 耍刀奇穴等级17 耍刀奇穴等级17，偏移456
data(1,217) =1 1 2 0 0 -1 耍刀奇穴等级18 耍刀奇穴等级18，偏移458
data(1,218) =1 1 2 0 0 -1 耍刀奇穴等级19 耍刀奇穴等级19，偏移460
data(1,219) =1 1 2 0 0 -1 耍刀奇穴等级20 耍刀奇穴等级20，偏移462
data(1,220) =1 1 2 0 0 -1 耍刀奇穴等级21 耍刀奇穴等级21，偏移464
data(1,221) =1 1 2 0 0 -1 耍刀奇穴等级22 耍刀奇穴等级22，偏移466
data(1,222) =1 1 2 0 0 -1 耍刀奇穴等级23 耍刀奇穴等级23，偏移468
data(1,223) =1 1 2 0 0 -1 耍刀奇穴等级24 耍刀奇穴等级24，偏移470
data(1,224) =1 1 2 0 0 -1 耍刀奇穴等级25 耍刀奇穴等级25，偏移472
data(1,225) =1 1 2 0 0 -1 奇门奇穴等级1 奇门奇穴等级1，偏移474
data(1,226) =1 1 2 0 0 -1 奇门奇穴等级2 奇门奇穴等级2，偏移476
data(1,227) =1 1 2 0 0 -1 奇门奇穴等级3 奇门奇穴等级3，偏移478
data(1,228) =1 1 2 0 0 -1 奇门奇穴等级4 奇门奇穴等级4，偏移480
data(1,229) =1 1 2 0 0 -1 奇门奇穴等级5 奇门奇穴等级5，偏移482
data(1,230) =1 1 2 0 0 -1 奇门奇穴等级6 奇门奇穴等级6，偏移484
data(1,231) =1 1 2 0 0 -1 奇门奇穴等级7 奇门奇穴等级7，偏移486
data(1,232) =1 1 2 0 0 -1 奇门奇穴等级8 奇门奇穴等级8，偏移488
data(1,233) =1 1 2 0 0 -1 奇门奇穴等级9 奇门奇穴等级9，偏移490
data(1,234) =1 1 2 0 0 -1 奇门奇穴等级10 奇门奇穴等级10，偏移492
data(1,235) =1 1 2 0 0 -1 奇门奇穴等级11 奇门奇穴等级11，偏移494
data(1,236) =1 1 2 0 0 -1 奇门奇穴等级12 奇门奇穴等级12，偏移496
data(1,237) =1 1 2 0 0 -1 奇门奇穴等级13 奇门奇穴等级13，偏移498
data(1,238) =1 1 2 0 0 -1 奇门奇穴等级14 奇门奇穴等级14，偏移500
data(1,239) =1 1 2 0 0 -1 奇门奇穴等级15 奇门奇穴等级15，偏移502
data(1,240) =1 1 2 0 0 -1 奇门奇穴等级16 奇门奇穴等级16，偏移504
data(1,241) =1 1 2 0 0 -1 奇门奇穴等级17 奇门奇穴等级17，偏移506
data(1,242) =1 1 2 0 0 -1 奇门奇穴等级18 奇门奇穴等级18，偏移508
data(1,243) =1 1 2 0 0 -1 奇门奇穴等级19 奇门奇穴等级19，偏移510
data(1,244) =1 1 2 0 0 -1 奇门奇穴等级20 奇门奇穴等级20，偏移512
data(1,245) =1 1 2 0 0 -1 奇门奇穴等级21 奇门奇穴等级21，偏移514
data(1,246) =1 1 2 0 0 -1 奇门奇穴等级22 奇门奇穴等级22，偏移516
data(1,247) =1 1 2 0 0 -1 奇门奇穴等级23 奇门奇穴等级23，偏移518
data(1,248) =1 1 2 0 0 -1 奇门奇穴等级24 奇门奇穴等级24，偏移520
data(1,249) =1 1 2 0 0 -1 奇门奇穴等级25 奇门奇穴等级25，偏移522
data(1,250) =1 1 2 0 0 -1 内功奇穴等级1 内功奇穴等级1，偏移524
data(1,251) =1 1 2 0 0 -1 内功奇穴等级2 内功奇穴等级2，偏移526
data(1,252) =1 1 2 0 0 -1 内功奇穴等级3 内功奇穴等级3，偏移528
data(1,253) =1 1 2 0 0 -1 内功奇穴等级4 内功奇穴等级4，偏移530
data(1,254) =1 1 2 0 0 -1 内功奇穴等级5 内功奇穴等级5，偏移532
data(1,255) =1 1 2 0 0 -1 内功奇穴等级6 内功奇穴等级6，偏移534
data(1,256) =1 1 2 0 0 -1 内功奇穴等级7 内功奇穴等级7，偏移536
data(1,257) =1 1 2 0 0 -1 内功奇穴等级8 内功奇穴等级8，偏移538
data(1,258) =1 1 2 0 0 -1 内功奇穴等级9 内功奇穴等级9，偏移540
data(1,259) =1 1 2 0 0 -1 内功奇穴等级10 内功奇穴等级10，偏移542
data(1,260) =1 1 2 0 0 -1 内功奇穴等级11 内功奇穴等级11，偏移544
data(1,261) =1 1 2 0 0 -1 内功奇穴等级12 内功奇穴等级12，偏移546
data(1,262) =1 1 2 0 0 -1 内功奇穴等级13 内功奇穴等级13，偏移548
data(1,263) =1 1 2 0 0 -1 内功奇穴等级14 内功奇穴等级14，偏移550
data(1,264) =1 1 2 0 0 -1 内功奇穴等级15 内功奇穴等级15，偏移552
data(1,265) =1 1 2 0 0 -1 内功奇穴等级16 内功奇穴等级16，偏移554
data(1,266) =1 1 2 0 0 -1 内功奇穴等级17 内功奇穴等级17，偏移556
data(1,267) =1 1 2 0 0 -1 内功奇穴等级18 内功奇穴等级18，偏移558
data(1,268) =1 1 2 0 0 -1 内功奇穴等级19 内功奇穴等级19，偏移560
data(1,269) =1 1 2 0 0 -1 内功奇穴等级20 内功奇穴等级20，偏移562
data(1,270) =1 1 2 0 0 -1 内功奇穴等级21 内功奇穴等级21，偏移564
data(1,271) =1 1 2 0 0 -1 内功奇穴等级22 内功奇穴等级22，偏移566
data(1,272) =1 1 2 0 0 -1 内功奇穴等级23 内功奇穴等级23，偏移568
data(1,273) =1 1 2 0 0 -1 内功奇穴等级24 内功奇穴等级24，偏移570
data(1,274) =1 1 2 0 0 -1 内功奇穴等级25 内功奇穴等级25，偏移572
data(1,275) =1 1 2 0 0 -1 武功招式1 武功招式1，偏移574
data(1,276) =1 1 2 0 0 -1 武功招式2 武功招式2，偏移576
data(1,277) =1 1 2 0 0 -1 武功招式3 武功招式3，偏移578
data(1,278) =1 1 2 0 0 -1 武功招式4 武功招式4，偏移580
data(1,279) =1 1 2 0 0 -1 武功招式5 武功招式5，偏移582
data(1,280) =1 1 2 0 0 -1 武功招式6 武功招式6，偏移584
data(1,281) =1 1 2 0 0 -1 武功招式7 武功招式7，偏移586
data(1,282) =1 1 2 0 0 -1 武功招式8 武功招式8，偏移588
data(1,283) =1 1 2 0 0 -1 武功招式9 武功招式9，偏移590
data(1,284) =1 1 2 0 0 -1 武功招式10 武功招式10，偏移592
data(1,285) =1 1 2 0 0 -1 武功招式11 武功招式11，偏移594
data(1,286) =1 1 2 0 0 -1 武功招式12 武功招式12，偏移596
data(1,287) =1 1 2 0 0 -1 武功招式13 武功招式13，偏移598
data(1,288) =1 1 2 0 0 -1 武功招式14 武功招式14，偏移600
data(1,289) =1 1 2 0 0 -1 武功招式15 武功招式15，偏移602
data(1,290) =1 1 2 0 0 -1 武功招式16 武功招式16，偏移604
data(1,291) =1 1 2 0 0 -1 武功招式17 武功招式17，偏移606
data(1,292) =1 1 2 0 0 -1 武功招式18 武功招式18，偏移608
data(1,293) =1 1 2 0 0 -1 武功招式19 武功招式19，偏移610
data(1,294) =1 1 2 0 0 -1 武功招式20 武功招式20，偏移612
data(1,295) =1 1 2 0 0 -1 武功招式21 武功招式21，偏移614
data(1,296) =1 1 2 0 0 -1 武功招式22 武功招式22，偏移616
data(1,297) =1 1 2 0 0 -1 武功招式23 武功招式23，偏移618
data(1,298) =1 1 2 0 0 -1 武功招式24 武功招式24，偏移620
data(1,299) =1 1 2 0 0 -1 武功招式25 武功招式25，偏移622
data(1,300) =1 1 2 0 0 -1 武功招式26 武功招式26，偏移624
data(1,301) =1 1 2 0 0 -1 武功招式27 武功招式27，偏移626
data(1,302) =1 1 2 0 0 -1 武功招式28 武功招式28，偏移628
data(1,303) =1 1 2 0 0 -1 武功招式29 武功招式29，偏移630
data(1,304) =1 1 2 0 0 -1 武功招式30 武功招式30，偏移632
data(1,305) =1 1 2 0 0 -1 武功招式31 武功招式31，偏移634
data(1,306) =1 1 2 0 0 -1 武功招式32 武功招式32，偏移636
data(1,307) =1 1 2 0 0 -1 武功招式33 武功招式33，偏移638
data(1,308) =1 1 2 0 0 -1 武功招式34 武功招式34，偏移640
data(1,309) =1 1 2 0 0 -1 武功招式35 武功招式35，偏移642
data(1,310) =1 1 2 0 0 -1 武功招式36 武功招式36，偏移644
data(1,311) =1 1 2 0 0 -1 武功招式37 武功招式37，偏移646
data(1,312) =1 1 2 0 0 -1 武功招式38 武功招式38，偏移648
data(1,313) =1 1 2 0 0 -1 武功招式39 武功招式39，偏移650
data(1,314) =1 1 2 0 0 -1 武功招式40 武功招式40，偏移652
data(1,315) =1 1 2 0 0 -1 武功招式41 武功招式41，偏移654
data(1,316) =1 1 2 0 0 -1 武功招式42 武功招式42，偏移656
data(1,317) =1 1 2 0 0 -1 武功招式43 武功招式43，偏移658
data(1,318) =1 1 2 0 0 -1 武功招式44 武功招式44，偏移660
data(1,319) =1 1 2 0 0 -1 武功招式45 武功招式45，偏移662
data(1,320) =1 1 2 0 0 -1 武功招式46 武功招式46，偏移664
data(1,321) =1 1 2 0 0 -1 武功招式47 武功招式47，偏移666
data(1,322) =1 1 2 0 0 -1 武功招式48 武功招式48，偏移668
data(1,323) =1 1 2 0 0 -1 武功招式49 武功招式49，偏移670
data(1,324) =1 1 2 0 0 -1 武功招式50 武功招式50，偏移672
data(1,325) =1 1 2 0 0 -1 武功招式51 武功招式51，偏移674
data(1,326) =1 1 2 0 0 -1 武功招式52 武功招式52，偏移676
data(1,327) =1 1 2 0 0 -1 武功招式53 武功招式53，偏移678
data(1,328) =1 1 2 0 0 -1 武功招式54 武功招式54，偏移680
data(1,329) =1 1 2 0 0 -1 武功招式55 武功招式55，偏移682
data(1,330) =1 1 2 0 0 -1 武功招式56 武功招式56，偏移684
data(1,331) =1 1 2 0 0 -1 武功招式57 武功招式57，偏移686
data(1,332) =1 1 2 0 0 -1 武功招式58 武功招式58，偏移688
data(1,333) =1 1 2 0 0 -1 武功招式59 武功招式59，偏移690
data(1,334) =1 1 2 0 0 -1 武功招式60 武功招式60，偏移692
data(1,335) =1 1 2 0 0 -1 武功招式61 武功招式61，偏移694
data(1,336) =1 1 2 0 0 -1 武功招式62 武功招式62，偏移696
data(1,337) =1 1 2 0 0 -1 武功招式63 武功招式63，偏移698
data(1,338) =1 1 2 0 0 -1 武功招式64 武功招式64，偏移700
data(1,339) =1 1 2 0 0 -1 武功招式65 武功招式65，偏移702
data(1,340) =1 1 2 0 0 -1 武功招式66 武功招式66，偏移704
data(1,341) =1 1 2 0 0 -1 武功招式67 武功招式67，偏移706
data(1,342) =1 1 2 0 0 -1 武功招式68 武功招式68，偏移708
data(1,343) =1 1 2 0 0 -1 武功招式69 武功招式69，偏移710
data(1,344) =1 1 2 0 0 -1 武功招式70 武功招式70，偏移712
data(1,345) =1 1 2 0 0 -1 武功招式71 武功招式71，偏移714
data(1,346) =1 1 2 0 0 -1 武功招式72 武功招式72，偏移716
data(1,347) =1 1 2 0 0 -1 武功招式73 武功招式73，偏移718
data(1,348) =1 1 2 0 0 -1 武功招式74 武功招式74，偏移720
data(1,349) =1 1 2 0 0 -1 武功招式75 武功招式75，偏移722
data(1,350) =1 1 2 0 0 -1 武功招式76 武功招式76，偏移724
data(1,351) =1 1 2 0 0 -1 武功招式77 武功招式77，偏移726
data(1,352) =1 1 2 0 0 -1 武功招式78 武功招式78，偏移728
data(1,353) =1 1 2 0 0 -1 武功招式79 武功招式79，偏移730
data(1,354) =1 1 2 0 0 -1 武功招式80 武功招式80，偏移732
data(1,355) =1 1 2 0 0 -1 武功招式81 武功招式81，偏移734
data(1,356) =1 1 2 0 0 -1 武功招式82 武功招式82，偏移736
data(1,357) =1 1 2 0 0 -1 武功招式83 武功招式83，偏移738
data(1,358) =1 1 2 0 0 -1 武功招式84 武功招式84，偏移740
data(1,359) =1 1 2 0 0 -1 武功招式85 武功招式85，偏移742
data(1,360) =1 1 2 0 0 -1 武功招式86 武功招式86，偏移744
data(1,361) =1 1 2 0 0 -1 武功招式87 武功招式87，偏移746
data(1,362) =1 1 2 0 0 -1 武功招式88 武功招式88，偏移748
data(1,363) =1 1 2 0 0 -1 武功招式89 武功招式89，偏移750
data(1,364) =1 1 2 0 0 -1 武功招式90 武功招式90，偏移752
data(1,365) =1 1 2 0 0 -1 武功招式91 武功招式91，偏移754
data(1,366) =1 1 2 0 0 -1 武功招式92 武功招式92，偏移756
data(1,367) =1 1 2 0 0 -1 武功招式93 武功招式93，偏移758
data(1,368) =1 1 2 0 0 -1 武功招式94 武功招式94，偏移760
data(1,369) =1 1 2 0 0 -1 武功招式95 武功招式95，偏移762
data(1,370) =1 1 2 0 0 -1 武功招式96 武功招式96，偏移764
data(1,371) =1 1 2 0 0 -1 武功招式97 武功招式97，偏移766
data(1,372) =1 1 2 0 0 -1 武功招式98 武功招式98，偏移768
data(1,373) =1 1 2 0 0 -1 武功招式99 武功招式99，偏移770
data(1,374) =1 1 2 0 0 -1 武功招式100 武功招式100，偏移772
data(1,375) =1 1 2 0 0 -1 武功招式101 武功招式101，偏移774
data(1,376) =1 1 2 0 0 -1 武功招式102 武功招式102，偏移776
data(1,377) =1 1 2 0 0 -1 武功招式103 武功招式103，偏移778
data(1,378) =1 1 2 0 0 -1 武功招式104 武功招式104，偏移780
data(1,379) =1 1 2 0 0 -1 武功招式105 武功招式105，偏移782
data(1,380) =1 1 2 0 0 -1 武功招式106 武功招式106，偏移784
data(1,381) =1 1 2 0 0 -1 武功招式107 武功招式107，偏移786
data(1,382) =1 1 2 0 0 -1 武功招式108 武功招式108，偏移788
data(1,383) =1 1 2 0 0 -1 武功招式109 武功招式109，偏移790
data(1,384) =1 1 2 0 0 -1 武功招式110 武功招式110，偏移792
data(1,385) =1 1 2 0 0 -1 武功招式111 武功招式111，偏移794
data(1,386) =1 1 2 0 0 -1 武功招式112 武功招式112，偏移796
data(1,387) =1 1 2 0 0 -1 武功招式113 武功招式113，偏移798
data(1,388) =1 1 2 0 0 -1 武功招式114 武功招式114，偏移800
data(1,389) =1 1 2 0 0 -1 武功招式115 武功招式115，偏移802
data(1,390) =1 1 2 0 0 -1 武功招式116 武功招式116，偏移804
data(1,391) =1 1 2 0 0 -1 武功招式117 武功招式117，偏移806
data(1,392) =1 1 2 0 0 -1 武功招式118 武功招式118，偏移808
data(1,393) =1 1 2 0 0 -1 武功招式119 武功招式119，偏移810
data(1,394) =1 1 2 0 0 -1 武功招式120 武功招式120，偏移812
data(1,395) =1 1 2 0 0 -1 武功招式121 武功招式121，偏移814
data(1,396) =1 1 2 0 0 -1 武功招式122 武功招式122，偏移816
data(1,397) =1 1 2 0 0 -1 武功招式123 武功招式123，偏移818
data(1,398) =1 1 2 0 0 -1 武功招式124 武功招式124，偏移820
data(1,399) =1 1 2 0 0 -1 武功招式125 武功招式125，偏移822
data(1,400) =1 1 2 0 0 -1 武功招式126 武功招式126，偏移824
data(1,401) =1 1 2 0 0 -1 武功招式127 武功招式127，偏移826
data(1,402) =1 1 2 0 0 -1 武功招式128 武功招式128，偏移828
data(1,403) =1 1 2 0 0 -1 武功招式129 武功招式129，偏移830
data(1,404) =1 1 2 0 0 -1 武功招式130 武功招式130，偏移832
data(1,405) =1 1 2 0 0 -1 武功招式131 武功招式131，偏移834
data(1,406) =1 1 2 0 0 -1 武功招式132 武功招式132，偏移836
data(1,407) =1 1 2 0 0 -1 武功招式133 武功招式133，偏移838
data(1,408) =1 1 2 0 0 -1 武功招式134 武功招式134，偏移840
data(1,409) =1 1 2 0 0 -1 武功招式135 武功招式135，偏移842
data(1,410) =1 1 2 0 0 -1 武功招式136 武功招式136，偏移844
data(1,411) =1 1 2 0 0 -1 武功招式137 武功招式137，偏移846
data(1,412) =1 1 2 0 0 -1 武功招式138 武功招式138，偏移848
data(1,413) =1 1 2 0 0 -1 武功招式139 武功招式139，偏移850
data(1,414) =1 1 2 0 0 -1 武功招式140 武功招式140，偏移852
data(1,415) =1 1 2 0 0 -1 武功招式141 武功招式141，偏移854
data(1,416) =1 1 2 0 0 -1 武功招式142 武功招式142，偏移856
data(1,417) =1 1 2 0 0 -1 武功招式143 武功招式143，偏移858
data(1,418) =1 1 2 0 0 -1 武功招式144 武功招式144，偏移860
data(1,419) =1 1 2 0 0 -1 武功招式145 武功招式145，偏移862
data(1,420) =1 1 2 0 0 -1 武功招式146 武功招式146，偏移864
data(1,421) =1 1 2 0 0 -1 武功招式147 武功招式147，偏移866
data(1,422) =1 1 2 0 0 -1 武功招式148 武功招式148，偏移868
data(1,423) =1 1 2 0 0 -1 武功招式149 武功招式149，偏移870
data(1,424) =1 1 2 0 0 -1 武功招式150 武功招式150，偏移872
data(1,425) =1 1 2 0 0 -1 门派位阶 门派位阶，偏移874
data(1,426) =1 1 2 0 0 -1 门派技能1 门派技能1，偏移876
data(1,427) =1 1 2 0 0 -1 门派技能2 门派技能2，偏移878
data(1,428) =1 1 2 0 0 -1 门派技能3 门派技能3，偏移880
data(1,429) =1 1 2 0 0 -1 门派技能4 门派技能4，偏移882
data(1,430) =1 1 2 0 0 -1 门派技能5 门派技能5，偏移884
data(1,431) =1 1 2 0 0 -1 门派技能6 门派技能6，偏移886
data(1,432) =1 1 2 0 0 -1 门派技能7 门派技能7，偏移888
data(1,433) =1 1 2 0 0 -1 门派技能8 门派技能8，偏移890
data(1,434) =1 1 2 0 0 -1 流血程度 流血程度，偏移892
data(1,435) =1 1 2 0 0 -1 封穴程度 封穴程度，偏移894

TypeName2=物品
TypedataItem2=70

data(2,0) =1 1 2 0 0 -1 代号 代号，偏移0
data(2,1) =1 1 20 1 1 -1 物品名 物品名，偏移2，似乎无用
data(2,2) =1 1 20 1 0 -1 物品名 物品名，偏移22
data(2,3) =1 1 30 1 0 -1 物品说明 物品说明，偏移42
data(2,4) =1 1 2 0 0 4 练出武功 练出武功，-1表示没有，偏移72
data(2,5) =1 1 2 0 0 -1 暗器动画编号 暗器动画编号，eft中的动画编号(0-52)，-1表示没有，偏移74
data(2,6) =1 1 2 0 0 1 使用人 当前使用物品的人，-1表示没有，偏移76
data(2,7) =1 1 2 0 0 -1 装备位置 0武器1防具2坐骑，-1表示不属于装备位置，偏移78
data(2,8) =1 1 2 0 0 -1 显示物品说明 0不显示，1显示，偏移80
data(2,9) =1 1 2 0 0 -1 类型 物品类型，0剧情，1装备，2秘笈，3药品，4暗器，偏移82
data(2,10) =1 1 2 0 0 -1 未知5 无用，偏移84
data(2,11) =1 1 2 0 0 -1 未知6 无用，偏移86
data(2,12) =1 1 2 0 0 -1 未知7 无用，偏移88
data(2,13) =1 1 2 0 0 -1 加生命 加生命，药品加生命，暗器减生命，适用物品类型：药品，暗器，偏移90
data(2,14) =1 1 2 0 0 -1 加生命最大值 加生命最大值，适用物品类型：药品，秘笈，偏移92
data(2,15) =1 1 2 0 0 -1 加中毒解毒 +中毒-解毒，适用物品类型：药品，偏移94
data(2,16) =1 1 2 0 0 -1 加体力 加体力，适用物品类型：药品，偏移96
data(2,17) =1 1 2 0 0 -1 改变内力性质 改变内力性质，设为2则内力改为阴阳调和。适用物品类型：药品、秘笈，偏移98
data(2,18) =1 1 2 0 0 -1 加内力 加内力，适用物品类型：药品，偏移100
data(2,19) =1 1 2 0 0 -1 加内力最大值 加内力最大值，适用物品类型：药品，偏移102
data(2,20) =1 1 2 0 0 -1 加攻击力 加攻击力，适用物品类型：药品、秘笈，偏移104
data(2,21) =1 1 2 0 0 -1 加轻功 加轻功，适用物品类型：药品、秘笈，偏移106
data(2,22) =1 1 2 0 0 -1 加防御力 加防御力，适用物品类型：药品、秘笈，偏移108
data(2,23) =1 1 2 0 0 -1 加医疗 加医疗，适用物品类型：药品、秘笈，偏移110
data(2,24) =1 1 2 0 0 -1 加使毒 加使毒，适用物品类型：药品、秘笈，偏移112
data(2,25) =1 1 2 0 0 -1 加解毒 加解毒，适用物品类型：药品、秘笈，偏移114
data(2,26) =1 1 2 0 0 -1 加抗毒 加抗毒，适用物品类型：药品、秘笈，偏移116
data(2,27) =1 1 2 0 0 -1 加拳掌 加拳掌，适用物品类型：药品、秘笈，偏移118
data(2,28) =1 1 2 0 0 -1 加指法 加指法，适用物品类型：药品、秘笈，偏移120
data(2,29) =1 1 2 0 0 -1 加御剑 加御剑，适用物品类型：药品、秘笈，偏移122
data(2,30) =1 1 2 0 0 -1 加耍刀 加耍刀，适用物品类型：药品、秘笈，偏移124
data(2,31) =1 1 2 0 0 -1 加特殊兵器 加特殊兵器，适用物品类型：药品、秘笈，偏移126
data(2,32) =1 1 2 0 0 -1 加暗器技巧 加暗器技巧，适用物品类型：药品、秘笈，偏移128
data(2,33) =1 1 2 0 0 -1 加武学常识 加武学常识，适用物品类型：药品、秘笈，偏移130
data(2,34) =1 1 2 0 0 -1 加品德 适用物品类型：秘笈，偏移132
data(2,35) =1 1 2 0 0 -1 加攻击次数 加攻击次数，适用物品类型：秘笈，偏移134
data(2,36) =1 1 2 0 0 -1 加功夫带毒 加功夫带毒，适用物品类型：药品、秘笈，偏移136
data(2,37) =1 1 2 0 0 1 仅修炼人物 仅修炼人物，偏移138
data(2,38) =1 1 2 0 0 -1 需内力性质 需内力性质，适用物品类型：装备、秘笈，偏移140
data(2,39) =1 1 2 0 0 -1 需内力 需内力，适用物品类型：装备、秘笈，偏移142
data(2,40) =1 1 2 0 0 -1 需攻击力 需攻击力，适用物品类型：装备、秘笈，偏移144
data(2,41) =1 1 2 0 0 -1 需轻功 需轻功，适用物品类型：装备、秘笈，偏移146
data(2,42) =1 1 2 0 0 -1 需用毒 需用毒，适用物品类型：装备、秘笈，偏移148
data(2,43) =1 1 2 0 0 -1 需医疗 需医疗，适用物品类型：装备、秘笈，偏移150
data(2,44) =1 1 2 0 0 -1 加命中 加命中，适用物品类型：装备、秘笈，偏移152
data(2,45) =1 1 2 0 0 -1 需拳掌 需拳掌，适用物品类型：装备、秘笈，偏移154
data(2,46) =1 1 2 0 0 -1 需指法 需指法，适用物品类型：装备、秘笈，偏移156
data(2,47) =1 1 2 0 0 -1 需御剑 需御剑，适用物品类型：装备、秘笈，偏移158
data(2,48) =1 1 2 0 0 -1 需耍刀 需耍刀，适用物品类型：装备、秘笈，偏移160
data(2,49) =1 1 2 0 0 -1 需特殊兵器 需特殊兵器，适用物品类型：装备、秘笈，偏移162
data(2,50) =1 1 2 0 0 -1 需暗器 需暗器，适用物品类型：装备、秘笈，偏移164
data(2,51) =1 1 2 0 0 -1 需资质 需资质，适用物品类型：装备、秘笈，偏移166
data(2,52) =1 1 2 0 0 -1 需经验 练成秘笈需要经验，适用物品类型：秘笈，偏移168
data(2,53) =1 1 2 0 0 -1 练出物品需经验 练出物品需经验，适用物品类型：秘笈，偏移170
data(2,54) =1 1 2 0 0 2 需材料 需材料，偏移172
data(2,55) =1 1 2 0 0 2 练出物品1 练出物品1，起始偏移174
data(2,56) =1 1 2 0 0 2 练出物品2 练出物品2，起始偏移176
data(2,57) =1 1 2 0 0 2 练出物品3 练出物品3，起始偏移178
data(2,58) =1 1 2 0 0 2 练出物品4 练出物品4，起始偏移180
data(2,59) =1 1 2 0 0 2 练出物品5 练出物品5，起始偏移182
data(2,60) =1 1 2 0 0 -1 需要物品1数量 需要物品1数量，起始偏移184
data(2,61) =1 1 2 0 0 -1 需要物品2数量 需要物品2数量，起始偏移184
data(2,62) =1 1 2 0 0 -1 需要物品3数量 需要物品3数量，起始偏移184
data(2,63) =1 1 2 0 0 -1 需要物品4数量 需要物品4数量，起始偏移184
data(2,64) =1 1 2 0 0 -1 需要物品5数量 需要物品5数量，起始偏移184
data(2,65) =1 1 2 0 0 -1 是否特效 0无特效，1有特效，起始偏移194
data(2,66) =1 1 2 0 0 -1 装备经验 装备经验，起始偏移196
data(2,67) =1 1 2 0 0 -1 装备等级 装备等级，起始偏移198
data(2,68) =1 1 2 0 0 -1 装备系别 装装系别，起始偏移200
data(2,69) =1 1 2 0 0 -1 加招架 加招架，起始偏移202

TypeName3 =场景
TypedataItem3 =23

data(3,0) =1 1 2 0 0 -1 代号 代号，偏移0
data(3,1) =1 1 10 1 1 -1 名称 名称，偏移2
data(3,2) =1 1 2 0 0 -1 出门音乐 出门音乐，偏移12
data(3,3) =1 1 2 0 0 -1 进门音乐 进门音乐，偏移14
data(3,4) =1 1 2 0 0 3 跳转场景 跳转到其它场景，-1表示没有。从一个场景跳转到另一个场景时用。，偏移16
data(3,5) =1 1 2 0 0 -1 进入条件 进入条件，0开放，1关闭，2队伍中轻功大于70才能进入，偏移18
data(3,6) =1 1 2 0 0 -1 外景入口X1 外景入口X1，如果不在外景有入口则设为0，起始偏移20
data(3,7) =1 1 2 0 0 -1 外景入口Y1 外景入口Y2，如果不在外景有入口则设为0，起始偏移22
data(3,8) =1 1 2 0 0 -1 外景入口X2 外景入口X2，如果不在外景有入口则设为0，起始偏移20
data(3,9) =1 1 2 0 0 -1 外景入口Y2 外景入口Y2，如果不在外景有入口则设为0，起始偏移22
data(3,10) =1 1 2 0 0 -1 入口X 入口X，进入场景主角初始坐标，偏移28
data(3,11) =1 1 2 0 0 -1 入口Y 入口Y，进入场景主角初始坐标，偏移30
data(3,12) =1 1 2 0 0 -1 出口X1 出口X1，场景出口坐标，起始偏移32
data(3,13) =1 1 2 0 0 -1 出口X2 出口X2，场景出口坐标，起始偏移32
data(3,14) =1 1 2 0 0 -1 出口X3 出口X3，场景出口坐标，起始偏移32
data(3,15) =1 1 2 0 0 -1 出口Y1 出口Y1，场景出口坐标，起始偏移38
data(3,16) =1 1 2 0 0 -1 出口Y2 出口Y2，场景出口坐标，起始偏移38
data(3,17) =1 1 2 0 0 -1 出口Y3 出口Y3，场景出口坐标，起始偏移38
data(3,18) =1 1 2 0 0 -1 跳转口X1 跳转口X1，X1跳转到其它场景入口坐标，X2从其它场景回来的坐标，起始偏移44
data(3,19) =1 1 2 0 0 -1 跳转口Y1 跳转口Y2，Y1跳转到其它场景入口坐标，Y2从其它场景回来的坐标，起始偏移46
data(3,20) =1 1 2 0 0 -1 跳转口X2 跳转口X2，X1跳转到其它场景入口坐标，X2从其它场景回来的坐标，起始偏移44
data(3,21) =1 1 2 0 0 -1 跳转口Y2 跳转口Y2，Y1跳转到其它场景入口坐标，Y2从其它场景回来的坐标，起始偏移46
data(3,22) =1 1 2 0 0 -1 场景类型 场景类型，偏移52

TypeName4=武功
TypedataItem4=85

data(4,0) =1 1 2 0 0 -1 代号 代号，偏移0
data(4,1) =1 1 10 1 1 -1 名称 名称，偏移2
data(4,2) =1 1 2 0 0 -1 未知 无用，偏移12
data(4,3) =1 1 2 0 0 -1 未知 无用，偏移14
data(4,4) =1 1 2 0 0 -1 未知 无用，偏移16
data(4,5) =1 1 2 0 0 -1 未知 无用，偏移18
data(4,6) =1 1 2 0 0 -1 未知 无用，偏移20
data(4,7) =1 1 2 0 0 -1 出招音效 出招音效，atk***.wav，偏移22
data(4,8) =1 1 2 0 0 -1 武功类型 1拳2指3剑4刀5奇门6内功7轻功，偏移24
data(4,9) =1 1 2 0 0 -1 武功动画&音效 武功动画&音效，eft中的动画，音效为e**.wav，偏移26
data(4,10) =1 1 2 0 0 -1 伤害类型 0杀伤生命1杀伤内力，偏移28
data(4,11) =1 1 2 0 0 -1 攻击范围 0点1线2十字3面，偏移30
data(4,12) =1 1 2 0 0 -1 消耗内力点数 消耗内力点数，偏移32
data(4,13) =1 1 2 0 0 -1 敌人中毒点数 敌人中毒点数，偏移34
data(4,14) =1 1 2 0 0 -1 1级攻击力 1级别攻击力，起始偏移36
data(4,15) =1 1 2 0 0 -1 2级攻击力 2级别攻击力，起始偏移36
data(4,16) =1 1 2 0 0 -1 3级攻击力 3级别攻击力，起始偏移36
data(4,17) =1 1 2 0 0 -1 4级攻击力 4级别攻击力，起始偏移36
data(4,18) =1 1 2 0 0 -1 5级攻击力 5级别攻击力，起始偏移36
data(4,19) =1 1 2 0 0 -1 6级攻击力 6级别攻击力，起始偏移36
data(4,20) =1 1 2 0 0 -1 7级攻击力 7级别攻击力，起始偏移36
data(4,21) =1 1 2 0 0 -1 8级攻击力 8级别攻击力，起始偏移36
data(4,22) =1 1 2 0 0 -1 9级攻击力 9级别攻击力，起始偏移36
data(4,23) =1 1 2 0 0 -1 10级攻击力 10级别攻击力，起始偏移36
data(4,24) =1 1 2 0 0 -1 1级移动范围 1级移动范围，起始偏移56
data(4,25) =1 1 2 0 0 -1 2级移动范围 2级移动范围，起始偏移56
data(4,26) =1 1 2 0 0 -1 3级移动范围 3级移动范围，起始偏移56
data(4,27) =1 1 2 0 0 -1 4级移动范围 4级移动范围，起始偏移56
data(4,28) =1 1 2 0 0 -1 5级移动范围 5级移动范围，起始偏移56
data(4,29) =1 1 2 0 0 -1 6级移动范围 6级移动范围，起始偏移56
data(4,30) =1 1 2 0 0 -1 7级移动范围 7级移动范围，起始偏移56
data(4,31) =1 1 2 0 0 -1 8级移动范围 8级移动范围，起始偏移56
data(4,32) =1 1 2 0 0 -1 9级移动范围 9级移动范围，起始偏移56
data(4,33) =1 1 2 0 0 -1 10级移动范围 10级移动范围，起始偏移56
data(4,34) =1 1 2 0 0 -1 1级杀伤范围 1级杀伤范围，起始偏移76
data(4,35) =1 1 2 0 0 -1 2级杀伤范围 2级杀伤范围，起始偏移76
data(4,36) =1 1 2 0 0 -1 3级杀伤范围 3级杀伤范围，起始偏移76
data(4,37) =1 1 2 0 0 -1 4级杀伤范围 4级杀伤范围，起始偏移76
data(4,38) =1 1 2 0 0 -1 5级杀伤范围 5级杀伤范围，起始偏移76
data(4,39) =1 1 2 0 0 -1 6级杀伤范围 6级杀伤范围，起始偏移76
data(4,40) =1 1 2 0 0 -1 7级杀伤范围 7级杀伤范围，起始偏移76
data(4,41) =1 1 2 0 0 -1 8级杀伤范围 8级杀伤范围，起始偏移76
data(4,42) =1 1 2 0 0 -1 9级杀伤范围 9级杀伤范围，起始偏移76
data(4,43) =1 1 2 0 0 -1 10级杀伤范围 10级杀伤范围，起始偏移76
data(4,44) =1 1 2 0 0 -1 1级加内力 1级加内力，起始偏移96
data(4,45) =1 1 2 0 0 -1 2级加内力 2级加内力，起始偏移96
data(4,46) =1 1 2 0 0 -1 3级加内力 3级加内力，起始偏移96
data(4,47) =1 1 2 0 0 -1 4级加内力 4级加内力，起始偏移96
data(4,48) =1 1 2 0 0 -1 5级加内力 5级加内力，起始偏移96
data(4,49) =1 1 2 0 0 -1 6级加内力 6级加内力，起始偏移96
data(4,50) =1 1 2 0 0 -1 7级加内力 7级加内力，起始偏移96
data(4,51) =1 1 2 0 0 -1 8级加内力 8级加内力，起始偏移96
data(4,52) =1 1 2 0 0 -1 9级加内力 9级加内力，起始偏移96
data(4,53) =1 1 2 0 0 -1 10级加内力 10级加内力，起始偏移96
data(4,54) =1 1 2 0 0 -1 1级杀伤内力 1级杀伤内力，起始偏移116
data(4,55) =1 1 2 0 0 -1 2级杀伤内力 2级杀伤内力，起始偏移116
data(4,56) =1 1 2 0 0 -1 3级杀伤内力 3级杀伤内力，起始偏移116
data(4,57) =1 1 2 0 0 -1 4级杀伤内力 4级杀伤内力，起始偏移116
data(4,58) =1 1 2 0 0 -1 5级杀伤内力 5级杀伤内力，起始偏移116
data(4,59) =1 1 2 0 0 -1 6级杀伤内力 6级杀伤内力，起始偏移116
data(4,60) =1 1 2 0 0 -1 7级杀伤内力 7级杀伤内力，起始偏移116
data(4,61) =1 1 2 0 0 -1 8级杀伤内力 8级杀伤内力，起始偏移116
data(4,62) =1 1 2 0 0 -1 9级杀伤内力 9级杀伤内力，起始偏移116
data(4,63) =1 1 2 0 0 -1 10级杀伤内力 10级杀伤内力，起始偏移116
data(4,64) =1 1 2 0 0 -1 冰封系数 为1时攻击可以触发冰封，偏移136
data(4,65) =1 1 2 0 0 -1 灼烧系数 为1时攻击可以触发灼烧，偏移138
data(4,66) =1 1 10 1 1 -1 门派 门派，偏移140
data(4,67) =1 1 2 0 0 -1 格档 格档，偏移150
data(4,68) =1 1 2 0 0 -1 灵巧系数 为1时攻击可以触发灵巧，偏移152
data(4,69) =1 1 2 0 0 -1 暂时无用 暂时无用，偏移154
data(4,70) =1 1 2 0 0 -1 层级 层级，偏移156
data(4,71) =1 1 2 0 0 -1 特效1 特，偏移158
data(4,72) =1 1 2 0 0 -1 特效2 特效2，偏移160
data(4,73) =1 1 2 0 0 -1 特效3 特效3，偏移162
data(4,74) =1 1 2 0 0 -1 特效4 特效4，偏移164
data(4,75) =1 1 2 0 0 -1 招式1 招式1，偏移166
data(4,76) =1 1 2 0 0 -1 招式2 招式2，偏移168
data(4,77) =1 1 2 0 0 -1 招式3 招式3，偏移170
data(4,78) =1 1 2 0 0 -1 招式4 招式4，偏移172
data(4,79) =1 1 2 0 0 -1 招式5 招式5，偏移174
data(4,80) =1 1 2 0 0 -1 招式6 招式6，偏移176
data(4,81) =1 1 2 0 0 -1 招式7 招式7，偏移178
data(4,82) =1 1 2 0 0 -1 招式8 招式8，偏移180
data(4,83) =1 1 2 0 0 -1 招式9 招式9，偏移182
data(4,84) =1 1 2 0 0 -1 招式10 招式10，偏移184

TypeName5 =小宝商店
TypedataItem5 =18

data(5,0) =1 1 2 0 0 2 物品1 物品1，起始偏移0
data(5,1) =1 1 2 0 0 2 物品2 物品2，起始偏移0
data(5,2) =1 1 2 0 0 2 物品3 物品3，起始偏移0
data(5,3) =1 1 2 0 0 2 物品4 物品4，起始偏移0
data(5,4) =1 1 2 0 0 2 物品5 物品5，起始偏移0
data(5,5) =1 1 2 0 0 2 物品6 物品6，起始偏移0
data(5,6) =1 1 2 0 0 -1 物品1数量 物品1数量，起始偏移12
data(5,7) =1 1 2 0 0 -1 物品2数量 物品2数量，起始偏移12
data(5,8) =1 1 2 0 0 -1 物品3数量 物品3数量，起始偏移12
data(5,9) =1 1 2 0 0 -1 物品4数量 物品4数量，起始偏移12
data(5,10) =1 1 2 0 0 -1 物品5数量 物品5数量，起始偏移12
data(5,11) =1 1 2 0 0 -1 物品6数量 物品6数量，起始偏移12
data(5,12) =1 1 2 0 0 -1 物品1价格 物品1价格，起始偏移24
data(5,13) =1 1 2 0 0 -1 物品2价格 物品2价格，起始偏移24
data(5,14) =1 1 2 0 0 -1 物品3价格 物品3价格，起始偏移24
data(5,15) =1 1 2 0 0 -1 物品4价格 物品4价格，起始偏移24
data(5,16) =1 1 2 0 0 -1 物品5价格 物品5价格，起始偏移24
data(5,17) =1 1 2 0 0 -1 物品6价格 物品6价格，起始偏移24


[W_Modify]
TypeDataItem=12
; 数组个数，数组结构成员个数，字节数，是否字串，是否名称，引用数据类型，名字，说明，是否地图号，标识类型，标识编号
; 间隔使用空格，一定要注意字符串中间不能有空格，而且空格只能有一个，等号后面不能有空格。
Data(0)=1 1 2 0 0 0 编号 地图编号 0 0 0
Data(1)=1 1 10 1 1 0 名称 地图名称 0 0 0
Data(2)=1 1 2 0 0 0 地图号 引用地图编号 1 0 0
Data(3)=1 1 2 0 0 0 经验 地图经验值 0 0 0
Data(4)=1 1 2 0 0 0 音乐 地图所用音乐 0 0 0
Data(5)=6 1 2 0 0 1 队友 参加的队友编号 0 0 5
Data(6)=6 1 2 0 0 1 自动队友 自动队友编号（不为空则读取自动队友） 0 0 7
Data(7)=6 1 2 0 0 0 队友X 队友X坐标 0 1 1
Data(8)=6 1 2 0 0 0 队友Y 队友Y坐标 0 1 2
Data(9)=20 1 2 0 0 1 敌人 敌人队友编号 0 0 6
Data(10)=20 1 2 0 0 0 敌人X 敌人X坐标 0 2 3
Data(11)=20 1 2 0 0 0 敌人Y 敌人Y坐标 0 2 4
;selectcontinue=0


[D_modify]
num=11
Attrib0=能否通过
Attrib1=编号
Attrib2=事件1
Attrib3=事件2
Attrib4=事件3
Attrib5=开始贴图
Attrib6=结束贴图
Attrib7=临时贴图
Attrib8=动画延迟
Attrib9=横坐标X
Attrib10=纵坐标Y

[50memory]
;50指令内存表
MemNum=14

Mem0=1C0B90 计秒，每3600/65536秒加1
Mem1=1C0B92 计时，计秒溢出则加1
Mem2=1C0BF8 当前主角贴图号
Mem3=544F2 当前主角面向
Mem4=1D295E 当前场景号
Mem5=1D295C 当前主角座标x
Mem6=1D295A 当前主角座标y
Mem7=1D2958 当前场景座标x
Mem8=1D2956 当前场景座标y
Mem9=1 战斗回合
Mem10=2 倒计时
Mem11=3 当钱事件
Mem12=4 战斗状态（0继续，1胜利，2失败）
Mem13=5 最大战斗人数
Mem14=6 自动刷新开关（0开，用于50指令显示图片、字符串）

[KdefAttrib]
;保存每条指令的属性，请不要更改"
Number=68

Attrib0=0 1 0 0 0 空指令(清屏)
Attrib1=1 4 0 0 0 对话(对话编号,人物头像代号,对话框位置)
Attrib2=2 3 0 0 0 得到物品(物品编号,数量)
Attrib3=3 14 0 0 0 重新修改事件内容
Attrib4=4 4 1 2 3 使用物体触发事件(物品编号,正确转向偏移量,不正确转向偏移量)
Attrib5=5 3 1 1 2 询问是否战斗(是转向偏移量,否转向偏移量) 
Attrib6=6 5 1 2 3 战斗(战斗场景编号,赢转向偏移量,输转向偏移量,输后是否有经验值得)
Attrib7=7 1 0 0 0 无条件返回，事件结束
Attrib8=8 2 0 0 0 改变大地图音乐(0300)
Attrib9=9 3 1 1 2 询问是否加入(是转向偏移量,否转向偏移量)
Attrib10=a 2 0 0 0 加入队员(人物代号) 
Attrib11=b 3 1 1 2 询问是否住宿(是转向偏移量,否转向偏移量) 
Attrib12=c 1 0 0 0 住宿
Attrib13=d 1 0 0 0 场景重新显示
Attrib14=e 1 0 0 0 场景从明亮渐变为暗淡
Attrib15=f 2 0 0 0 死亡回到选单(5300)
Attrib16=10 4 1 2 3 判断某个人是否在队中(人代号,在转向偏移量,不在转向偏移量)
Attrib17=11 6 0 0 0 修改场景的s*贴图(场景编号,图层,横坐标,纵坐标,贴图编号)
Attrib18=12 4 1 2 3 判断是否有某种物品(物品编号,有转向偏移量,没有转向偏移量)
Attrib19=13 3 0 0 0 改变主角当前位置(目标x,目标y) 
Attrib20=14 3 1 1 2 判断队伍是否满(满转向偏移量,不满转向偏移量) 
Attrib21=15 2 0 0 0 队员离队(人代号) 
Attrib22=16 1 0 0 0 内力降为0 
Attrib23=17 3 0 0 0 设置用毒能力(人代号,数值)
Attrib24=18 1 0 0 0 死亡黒色背景
Attrib25=19 5 0 0 0 场景移动(原始x,原始y,目标x,目标y) 
Attrib26=1a 6 0 0 0 增加场景事件编号的三个触发事件编号
Attrib27=1b 4 0 0 0 显示动画(图1,图2,图3)
Attrib28=1c 6 1 4 5 判断品德(人代号,数值下限,数值上限,达到转向偏移量,否转向偏移量)
Attrib29=1d 6 1 4 5 判断武力(人代号,数值下限,数值上限,达到转向偏移量,否转向偏移量) 
Attrib30=1e 5 0 0 0 主角走动(原始x,原始y,目标x,目标y)
Attrib31=1f 4 1 2 3 判断是否够钱(需要钱数,够钱转向偏移量,不够转向偏移量)
Attrib32=20 3 0 0 0 增加物品数量(物品编号,数量) 
Attrib33=21 4 0 0 0 学会武功(人代号,武功编号,[0000显示学会什么武功]) 
Attrib34=22 3 0 0 0 增加资质(人代号,数值) 
Attrib35=23 5 0 0 0 设置武功(人代号,武功栏位,武功编号,武功点数)
Attrib36=24 4 1 2 3 判断主角的性别(主角的性别,是转向偏移量,否转向偏移量)
Attrib37=25 2 0 0 0 设置品德(数值) 
Attrib38=26 5 0 0 0 修改场景贴图(场景编号,图层编号,原有贴图,修改后贴图)
Attrib39=27 2 0 0 0 打开场景(场景编号)
Attrib40=28 2 0 0 0 主角面向何方(站立图编号) 
Attrib41=29 4 0 0 0 非我方队员增加物品(人代号,物品编号,数量) 
Attrib42=2a 3 1 1 2 判断队里是否有女性(是转向偏移量,否转向偏移量)
Attrib43=2b 4 1 2 3 判断物品栏里是否有指定物品(物品编号,有转向偏移量,无转向偏移量) 
Attrib44=2c 7 0 0 0 播放动画
Attrib45=2d 3 0 0 0 增加轻功(人代号,数值)
Attrib46=2e 3 0 0 0 增加内力(人代号,数值)
Attrib47=2f 3 0 0 0 增加武力(人代号,数值)
Attrib48=30 3 0 0 0 增加生命(人代号,数值)
Attrib49=31 3 0 0 0 设置内力属性(人代号,数值)
;    Attrib50=32 8 1 6 7 判断物品栏里是否有指定的5种物品
Attrib50=32 8 0 0 0 判断物品栏里是否有指定的5种物品
Attrib51=33 1 0 0 0 问软体娃娃
Attrib52=34 1 0 0 0 看道德
Attrib53=35 1 0 0 0 看声望
Attrib54=36 1 0 0 0 见过南贤后可以进入各场景
Attrib55=37 5 1 3 4 判断事件编号(事件编号,给定编号,是偏移,否偏移)
Attrib56=38 2 0 0 0 增加声望(数值)
Attrib57=39 1 0 0 0 主角在高昌迷宫砍石门的动画
Attrib58=3a 1 0 0 0 武道大会比武
Attrib59=3b 1 0 0 0 全部队员离队并找不到
Attrib60=3c 6 1 4 5 判断场景某层某图块？？？(？,？,某地一幅图块,是偏移,否偏移)
Attrib61=3d 3 1 1 2 判断是否放完14本书？(是偏移,否偏移) 
Attrib62=3e 7 0 0 0 播放进入时空机动画
Attrib63=3f 3 0 0 0 设置性别(人代号,数值)
Attrib64=40 1 0 0 0 韦小宝卖东西 
Attrib65=41 1 0 0 0 韦小宝去其它客栈
Attrib66=42 2 0 0 0 播放音乐(音乐编号) 
Attrib67=43 2 0 0 0 播放声音(声音编号)
Attrib68=44 8 0 0 0 新对话(头像号,对话号,显示名字,显示位置,是否显示头像,颜色)
Attrib69=45 4 0 0 0 对话替换字符
Attrib70=46 3 0 0 0 显示字幕(对话号，颜色)
Attrib71=47 4 0 0 0 场景跳转(场景编号，X，Y)
Attrib72=48 6 0 0 0 设置人物属性(人物编号,模式,加等级，最低，最高)

; 指令50的含义翻译
[kdef50]

    ; 最大指令个数
    num=50    

    Sub0=变量赋值
    Sub1=数组变量赋值
    Sub2=取数组变量值
    sub3=四则运算
    Sub4=变量判断
    SUB5=全部变量清零
    sub6=定义变量名
    SUb8=读对话到字符串
    Sub9=Sprintf
    Sub10=取字符串长度
    Sub11=字符串合并
    Sub12=空格字符串
    SUb16=保存属性
    SUb17=读取属性
    sub18=保存队伍
    sub19=读取队伍
    sub20=主角200个物品数量
    sub21=保存D*数据
    sub22=读取D*数据
    sub23=保存S*数据
    sub24=读取S*数据
    sub25=保存给定地址数据
    sub26=读取给定地址数据
    sub27=取属性名称
    sub28=取当前人物战斗序号
    sub29=选择攻击目标
    sub30=读取人物战斗属性
    sub31=保存人物战斗属性
    sub32=修改下一条指令
    sub33=显示字符串
    sub34=处理背景
    sub35=读取键盘
    sub36=显示字符串并等待击键
    sub37=延时
    sub38=随机数
    sub39=菜单选择
    sub40=滚动菜单选择
    sub41=显示图片
    sub42=改变主地图坐标
    sub43=调用其它事件
    sub44=播放效果
    sub45=显示数字  
    sub46=设定效果层
    sub47=重置战场贴图 
    sub48=调试指令，显示变量
    sub49=传说中的调用任意子程     

    Other=无

